import pandas as pd
import pytest


@pytest.fixture
def test_transactions():
    return pd.DataFrame(
        {
        "Дата операции": ["27.02.2025 11:59:39", "26.02.2025 11:59:39", "20.02.2025 11:59:39"],
        "Статус": ["OK", "OK", "OK"],
        "Категория": ["Фастфуд", "Каршеринг", "Транспорт"],
        "Сумма платежа": [-100, -200, -300]
        }
    )

@pytest.fixture
def test_transactions_list():
    return [
        {
        "Номер карты": "*7197",
        "Дата операции": "27.02.2025 11:59:39",
        "Описание": "Rumyanyj Khleb",
        "Кэшбэк": "sum",
        "Категория": "Фастфуд",
        "Сумма платежа": -100
        },
        {
        "Номер карты": "*5091",
        "Дата операции": "26.02.2025 11:59:39",
        "Описание": "Ситидрайв",
        "Кэшбэк": "sum",
        "Категория": "Каршеринг",
        "Сумма платежа": -200
        },
        {
        "Номер карты": "*4556",
        "Дата операции": "20.02.2025 11:59:39",
        "Описание": "Bars 2",
        "Кэшбэк": "sum",
        "Категория": "Транспорт",
        "Сумма платежа": -300}
        ]
