from typing import List, Dict, Any

import pandas as pd
import pytest



@pytest.fixture
def test_transactions() -> pd.DataFrame:
    return pd.DataFrame(
        {
            "Дата операции": ["27.02.2025 11:59:39", "26.02.2025 11:59:39", "20.02.2025 11:59:39"],
            "Статус": ["OK", "OK", "OK"],
            "Категория": ["Фастфуд", "Каршеринг", "Транспорт"],
            "Сумма платежа": [-100, -200, -300],
        }
    )


@pytest.fixture
def test_transactions_list() -> List[Dict[str, Any]]:
    return [
        {
            "Номер карты": "*7197",
            "Дата операции": "27.02.2025 11:59:39",
            "Описание": "Rumyanyj Khleb",
            "Кэшбэк": "sum",
            "Категория": "Фастфуд",
            "Сумма платежа": -100,
        },
        {
            "Номер карты": "*5091",
            "Дата операции": "26.02.2025 11:59:39",
            "Описание": "Ситидрайв",
            "Кэшбэк": "sum",
            "Категория": "Каршеринг",
            "Сумма платежа": -200,
        },
        {
            "Номер карты": "*4556",
            "Дата операции": "20.02.2025 11:59:39",
            "Описание": "Bars 2",
            "Кэшбэк": "sum",
            "Категория": "Транспорт",
            "Сумма платежа": -300,
        },
    ]


@pytest.fixture
def test_user_settings() -> Dict[str, Any]:
    return {"user_currencies": ["USD", "EUR", "RUB"], "user_stocks": ["AAPL", "GOOGL"]}


@pytest.fixture
def all_transaction() -> pd.DataFrame:
    return pd.DataFrame(
        {
            "Дата операции": [
                "31.12.2021 16:44:00",
                "31.12.2021 16:42:04",
                "31.12.2021 16:39:04",
                "31.12.2021 15:44:39",
                "31.12.2021 01:23:42",
                "31.12.2021 00:12:53",
                "30.12.2021 22:22:03",
                "30.12.2021 19:18:22",
                "30.12.2021 19:06:39",
                "30.12.2021 17:50:30",
                "30.12.2021 17:50:17",
            ],
            "Дата платежа": [
                "31.12.2021",
                "31.12.2021",
                "31.12.2021",
                "31.12.2021",
                "31.12.2021",
                "31.12.2021",
                "31.12.2021",
                "31.12.2021",
                "31.12.2021",
                "30.12.2021",
                "30.12.2021",
            ],
            "Номер карты": ["*7197", "*7197", "*7197", "*7197", "*5091", "", "", "*5091", "*7197", "*4556", "*4556"],
            "Статус": ["OK", "OK", "OK", "OK", "OK", "OK", "OK", "OK", "OK", "OK", "OK"],
            "Сумма операции": [
                -160.89,
                -64.00,
                -118.12,
                -78.05,
                -564.00,
                -800.00,
                -20000.00,
                -7.07,
                -1.32,
                5046.00,
                174000.00,
            ],
            "Валюта операции": ["RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB"],
            "Сумма платежа": [
                -160.89,
                -64.00,
                -118.12,
                -78.05,
                -564.00,
                -800.00,
                -20000.00,
                -7.07,
                -1.32,
                5046.00,
                174000.00,
            ],
            "Валюта платежа": ["RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB"],
            "Кэшбэк": ["", "", "", "", "", "", "", "", "", "", ""],
            "Категория": [
                "Супермаркеты",
                "Супермаркеты",
                "Супермаркеты",
                "Супермаркеты",
                "Различные товары",
                "Переводы",
                "Переводы",
                "Каршеринг",
                "Каршеринг",
                "Пополнения",
                "Пополнения",
            ],
            "MCC": [
                "5411",
                "5411",
                "5411",
                "5411",
                "5399",
                "",
                "",
                "7512",
                "7512",
                "",
                "",
            ],
            "Описание": [
                "Колхоз",
                "Колхоз",
                "Магнит",
                "Колхоз",
                "Ozon.ru",
                "Константин Л.",
                "Константин Л.",
                "Ситидрайв",
                "Ситидрайв",
                "Пополнение через Газпромбанк",
                "Пополнение через Газпромбанк",
            ],
            "Бонусы(включая кэшбэк)": [3.00, 1.00, 2.00, 1.00, 5.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
            "Округление на инвесткопилку": [
                0.00,
                0.00,
                0.00,
                0.00,
                0.00,
                0.00,
                0.00,
                0.00,
                0.00,
                0.00,
                0.00,
            ],
            "Сумма операции с округлением": [
                160.89,
                64.00,
                118.12,
                78.05,
                564.00,
                800.00,
                20000.00,
                7.07,
                1.32,
                5046.00,
                174000.00,
            ],
        }
    )


@pytest.fixture
def sample_transactions():
    return [
        {"description": "Покупка в магазине", "category": "Супермаркеты", "amount": 100.0},
        {"description": "Оплата интернета", "category": "Коммунальные услуги", "amount": 500.0},
        {"description": "Покупка на Ozon", "category": "Различные товары", "amount": 200.0},
    ]
